; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-5-2-4-7-7-5) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 depot4 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 truck2 truck3 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 - Pallet
	crate0 crate1 crate2 crate3 crate4 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate2)
	(at pallet3 depot3)
	(clear pallet3)
	(at pallet4 depot4)
	(clear pallet4)
	(at pallet5 distributor0)
	(clear crate4)
	(at pallet6 distributor1)
	(clear crate3)
	(at truck0 depot2)
	(at truck1 depot3)
	(at truck2 depot1)
	(at truck3 distributor1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 depot4)
	(available hoist4)
	(at hoist5 distributor0)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at crate0 distributor1)
	(on crate0 pallet6)
	(at crate1 distributor0)
	(on crate1 pallet5)
	(at crate2 depot2)
	(on crate2 pallet2)
	(at crate3 distributor1)
	(on crate3 crate0)
	(at crate4 distributor0)
	(on crate4 crate1)
)

(:goal (and
		(on crate0 pallet0)
		(on crate2 crate0)
		(on crate3 pallet1)
		(on crate4 pallet2)
	)
))

; plan
1. (lift hoist6 crate3 crate0 distributor1)
   deleted: (at crate3 distributor1) (available hoist6) (on crate3 crate0) (clear crate3)
   added: (lifting hoist6 crate3) (clear crate0)
   goals met: 0 of 4
2. (load hoist6 crate3 truck3 distributor1)
   deleted: (lifting hoist6 crate3)
   added: (in crate3 truck3) (available hoist6)
   goals met: 0 of 4
3. (lift hoist6 crate0 pallet6 distributor1)
   deleted: (at crate0 distributor1) (available hoist6) (on crate0 pallet6) (clear crate0)
   added: (lifting hoist6 crate0) (clear pallet6)
   goals met: 0 of 4
4. (load hoist6 crate0 truck3 distributor1)
   deleted: (lifting hoist6 crate0)
   added: (in crate0 truck3) (available hoist6)
   goals met: 0 of 4
5. (lift hoist5 crate4 crate1 distributor0)
   deleted: (at crate4 distributor0) (available hoist5) (on crate4 crate1) (clear crate4)
   added: (lifting hoist5 crate4) (clear crate1)
   goals met: 0 of 4
6. (drive truck3 distributor1 distributor0)
   deleted: (at truck3 distributor1)
   added: (at truck3 distributor0)
   goals met: 0 of 4
7. (load hoist5 crate4 truck3 distributor0)
   deleted: (lifting hoist5 crate4)
   added: (in crate4 truck3) (available hoist5)
   goals met: 0 of 4
8. (lift hoist2 crate2 pallet2 depot2)
   deleted: (at crate2 depot2) (available hoist2) (on crate2 pallet2) (clear crate2)
   added: (lifting hoist2 crate2) (clear pallet2)
   goals met: 0 of 4
9. (drive truck3 distributor0 depot2)
   deleted: (at truck3 distributor0)
   added: (at truck3 depot2)
   goals met: 0 of 4
10. (load hoist2 crate2 truck3 depot2)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck3) (available hoist2)
   goals met: 0 of 4
11. (unload hoist2 crate4 truck3 depot2)
   deleted: (available hoist2) (in crate4 truck3)
   added: (lifting hoist2 crate4)
   goals met: 0 of 4
12. (drop hoist2 crate4 pallet2 depot2)
   deleted: (lifting hoist2 crate4) (clear pallet2)
   added: (at crate4 depot2) (available hoist2) (on crate4 pallet2) (clear crate4)
   goals met: 1 of 4
13. (drive truck3 depot2 depot0)
   deleted: (at truck3 depot2)
   added: (at truck3 depot0)
   goals met: 1 of 4
14. (unload hoist0 crate0 truck3 depot0)
   deleted: (available hoist0) (in crate0 truck3)
   added: (lifting hoist0 crate0)
   goals met: 1 of 4
15. (drop hoist0 crate0 pallet0 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet0)
   added: (at crate0 depot0) (available hoist0) (on crate0 pallet0) (clear crate0)
   goals met: 2 of 4
16. (unload hoist0 crate2 truck3 depot0)
   deleted: (available hoist0) (in crate2 truck3)
   added: (lifting hoist0 crate2)
   goals met: 2 of 4
17. (drive truck3 depot0 depot1)
   deleted: (at truck3 depot0)
   added: (at truck3 depot1)
   goals met: 2 of 4
18. (drop hoist0 crate2 crate0 depot0)
   deleted: (lifting hoist0 crate2) (clear crate0)
   added: (at crate2 depot0) (available hoist0) (on crate2 crate0) (clear crate2)
   goals met: 3 of 4
19. (unload hoist1 crate3 truck3 depot1)
   deleted: (available hoist1) (in crate3 truck3)
   added: (lifting hoist1 crate3)
   goals met: 3 of 4
20. (drop hoist1 crate3 pallet1 depot1)
   deleted: (lifting hoist1 crate3) (clear pallet1)
   added: (at crate3 depot1) (available hoist1) (on crate3 pallet1) (clear crate3)
   goals met: 4 of 4
